## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 15 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| update   | `module.ai_answers_vpc.aws_default_network_acl.default`                                             |
|          | `module.ai_answers_vpc.aws_default_route_table.default`                                             |
|          | `module.ai_answers_vpc.aws_default_security_group.default`                                          |
|          | `module.ai_answers_vpc.aws_eip.nat[0]`                                                              |
|          | `module.ai_answers_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|          | `module.ai_answers_vpc.aws_internet_gateway.gw`                                                     |
|          | `module.ai_answers_vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|          | `module.ai_answers_vpc.aws_network_acl.main`                                                        |
|          | `module.ai_answers_vpc.aws_route_table.private[0]`                                                  |
|          | `module.ai_answers_vpc.aws_route_table.public`                                                      |
|          | `module.ai_answers_vpc.aws_subnet.private[0]`                                                       |
|          | `module.ai_answers_vpc.aws_subnet.private[1]`                                                       |
|          | `module.ai_answers_vpc.aws_subnet.public[0]`                                                        |
|          | `module.ai_answers_vpc.aws_subnet.public[1]`                                                        |
|          | `module.ai_answers_vpc.aws_vpc.main`                                                                |
| recreate | `module.ai_answers_vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|          | `module.ai_answers_vpc.aws_flow_log.flow_logs[0]`                                                   |
|          | `module.ai_answers_vpc.aws_iam_role.flow_logs[0]`                                                   |
|          | `module.ai_answers_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ai_answers_vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.ai_answers_vpc.aws_cloudwatch_log_group.flow_logs[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "flow_logs" {
      ~ arn               = "arn:aws:logs:ca-central-1:992382783569:log-group:ai-answers_flow_logs" -> (known after apply)
      ~ id                = "ai-answers_flow_logs" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "ai-answers_flow_logs" -> "ai-answers-staging_flow_logs" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-05ffaeff194910de1"
      ~ tags                   = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_default_nacl" -> "ai-answers-staging_default_nacl"
            "Terraform"  = "true"
        }
      ~ tags_all               = {
          ~ "Name"       = "ai-answers_default_nacl" -> "ai-answers-staging_default_nacl"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_default_route_table.default will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-086eaf6769ebf927d"
      ~ tags                   = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
          ~ "name"       = "ai-answers_default_route_table" -> "ai-answers-staging_default_route_table"
        }
      ~ tags_all               = {
          ~ "name"       = "ai-answers_default_route_table" -> "ai-answers-staging_default_route_table"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-0e88f395a4ae35e3f"
        name                   = "default"
      ~ tags                   = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_default_sg" -> "ai-answers-staging_default_sg"
            "Terraform"  = "true"
        }
      ~ tags_all               = {
          ~ "Name"       = "ai-answers_default_sg" -> "ai-answers-staging_default_sg"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-03c24db1ea68b15e9"
      ~ tags                     = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers-eip0" -> "ai-answers-staging-eip0"
            "Terraform"  = "true"
        }
      ~ tags_all                 = {
          ~ "Name"       = "ai-answers-eip0" -> "ai-answers-staging-eip0"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_flow_log.flow_logs[0] must be replaced
-/+ resource "aws_flow_log" "flow_logs" {
      ~ arn                        = "arn:aws:ec2:ca-central-1:992382783569:vpc-flow-log/fl-0cc45f5437aed78ca" -> (known after apply)
      ~ iam_role_arn               = "arn:aws:iam::992382783569:role/ai-answers_flow_logs" -> (known after apply) # forces replacement
      ~ id                         = "fl-0cc45f5437aed78ca" -> (known after apply)
      ~ log_destination            = "arn:aws:logs:ca-central-1:992382783569:log-group:ai-answers_flow_logs" -> (known after apply) # forces replacement
      ~ log_format                 = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      ~ log_group_name             = "ai-answers_flow_logs" -> (known after apply)
        tags                       = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
        id               = "arn:aws:iam::992382783569:policy/VpcMetricsFlowLogsWrite"
        name             = "VpcMetricsFlowLogsWrite"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:992382783569:log-group:ai-answers_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:992382783569:log-group:ai-answers_flow_logs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_iam_role.flow_logs[0] must be replaced
-/+ resource "aws_iam_role" "flow_logs" {
      ~ arn                   = "arn:aws:iam::992382783569:role/ai-answers_flow_logs" -> (known after apply)
      ~ create_date           = "2025-02-05T19:50:26Z" -> (known after apply)
      ~ id                    = "ai-answers_flow_logs" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::992382783569:policy/VpcMetricsFlowLogsWrite",
        ] -> (known after apply)
      ~ name                  = "ai-answers_flow_logs" -> "ai-answers-staging_flow_logs" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA6ODU7SBIT3TVLIRLV" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.ai_answers_vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "vpc_metrics_flow_logs_write_policy_attach" {
      ~ id         = "ai-answers_flow_logs-20250205221323294600000002" -> (known after apply)
      ~ role       = "ai-answers_flow_logs" -> "ai-answers-staging_flow_logs" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ai_answers_vpc.aws_internet_gateway.gw will be updated in-place
  ~ resource "aws_internet_gateway" "gw" {
        id       = "igw-01d63d88136f9d158"
      ~ tags     = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_internet_gateway" -> "ai-answers-staging_internet_gateway"
            "Terraform"  = "true"
        }
      ~ tags_all = {
          ~ "Name"       = "ai-answers_internet_gateway" -> "ai-answers-staging_internet_gateway"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_nat_gateway.nat_gw[0] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-0e39985c8f54876a6"
      ~ tags                               = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers-natgw-0" -> "ai-answers-staging-natgw-0"
            "Terraform"  = "true"
        }
      ~ tags_all                           = {
          ~ "Name"       = "ai-answers-natgw-0" -> "ai-answers-staging-natgw-0"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-08c69ce76a3122bef"
      ~ tags       = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_main_nacl" -> "ai-answers-staging_main_nacl"
            "Terraform"  = "true"
        }
      ~ tags_all   = {
          ~ "Name"       = "ai-answers_main_nacl" -> "ai-answers-staging_main_nacl"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0c47b78f72ad2c1f4"
      ~ tags             = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_private_route_table_0" -> "ai-answers-staging_private_route_table_0"
            "Terraform"  = "true"
        }
      ~ tags_all         = {
          ~ "Name"       = "ai-answers_private_route_table_0" -> "ai-answers-staging_private_route_table_0"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0997622fe2a042086"
      ~ tags             = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_public_route_table" -> "ai-answers-staging_public_route_table"
            "Terraform"  = "true"
        }
      ~ tags_all         = {
          ~ "Name"       = "ai-answers_public_route_table" -> "ai-answers-staging_public_route_table"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-082b42e264aba1387"
      ~ tags                                           = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_private_subnet_ca-central-1a" -> "ai-answers-staging_private_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "ai-answers_private_subnet_ca-central-1a" -> "ai-answers-staging_private_subnet_ca-central-1a"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers_vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a7e04118bcabd651"
      ~ tags                                           = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_private_subnet_ca-central-1b" -> "ai-answers-staging_private_subnet_ca-central-1b"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "ai-answers_private_subnet_ca-central-1b" -> "ai-answers-staging_private_subnet_ca-central-1b"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai_answers_vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0d3c0e10e6fd0e4bf"
      ~ tags                                           = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_public_subnet_ca-central-1a" -> "ai-answers-staging_public_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "ai-answers_public_subnet_ca-central-1a" -> "ai-answers-staging_public_subnet_ca-central-1a"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0bf150cb1ad932800"
      ~ tags                                           = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_public_subnet_ca-central-1b" -> "ai-answers-staging_public_subnet_ca-central-1b"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
      ~ tags_all                                       = {
          ~ "Name"       = "ai-answers_public_subnet_ca-central-1b" -> "ai-answers-staging_public_subnet_ca-central-1b"
            # (3 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.ai_answers_vpc.aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                                   = "vpc-0659c9b2d7046368f"
      ~ tags                                 = {
            "CostCentre" = "ai-answers-staging"
          ~ "Name"       = "ai-answers_vpc" -> "ai-answers-staging_vpc"
            "Terraform"  = "true"
        }
      ~ tags_all                             = {
          ~ "Name"       = "ai-answers_vpc" -> "ai-answers-staging_vpc"
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 4 to add, 15 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.app"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
